Revit 2027 API
SelectionFilterElement.RemoveSet Method
 Removes a set of ElementIds from the filter's set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int RemoveSet(
	ICollection<ElementId> ids
)
Public Function RemoveSet (
	ids As ICollection(Of ElementId)
) As Integer
public:
int RemoveSet(
	ICollection<ElementId^>^ ids
)
member RemoveSet :
        ids : ICollection<ElementId> -> int
Parameters
ids ICollection<ElementId>
 The set of ElementIds to remove.
Return Value
Int32
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SelectionFilterElement Class
Autodesk.Revit.DB Namespace